# *Credit Card Fraud Detection - Task 1*

![logo](images/logo1.jpg)

In [7]:
import pandas as pd

## Compreensão dos Dados

### Recolha dos Dados Iniciais

O *dataset* fornecido é constituído por quatro ficheiros, dividindo a informação da forma abaixo exposta.

1. **cities.csv:** informação sobre várias cidades
2. **customers.csv:** informação demográfica de cada cliente
3. **merchants.csv:** detalhes de cada comerciante
4. **transactions.csv:** registos de transações individuais

O ficheiro **cities.csv**, que contém informação sobre várias cidades, é constituído por 1000 linhas e 5 colunas.

Cada linha representa uma cidade e as colunas são as seguintes:

0. **city:** nome da cidade
1. **lat:** latitude da cidade
2. **lon:** longitude da cidade
3. **city_pop:** população da cidade
4. **state:** estado a que pertence a cidade

In [8]:
cities = pd.read_csv("data/cities.csv")
cities.info()
cities.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      1000 non-null   object
 1   lat       1000 non-null   float64
 2   long      1000 non-null   float64
 3   city_pop  1000 non-null   int64
 4   state     1000 non-null   object
dtypes: float64(2), int64(1), object(2)
memory usage: 39.2+ KB

          city        lat        long  city_pop state
0  Los Angeles -74.548889   99.427394    241017    CA
1      Houston -42.365373 -144.864377     80059    IL
2      Phoenix  88.913019 -110.233489    974249    AZ
3      Phoenix -41.381127  126.168580    331243    AZ
4  Los Angeles  14.491613   34.365628    773771    AZ

O ficheiro **customers.csv**, que contém a informação demográfica de cada cliente, é constituído por 1100 linhas e 9 colunas.

Cada linha representa um cliente e as colunas são as seguintes:

0. **cc_num:** número do cartão de crédito do cliente
1. **first:** primeiro nome do cliente
2. **last:** último nome do cliente
3. **gender:** género do cliente
4. **street:** rua da morada do cliente
5. **city:** cidade da morada do cliente
6. **zip:** código-postal da morada do cliente
7. **job:** emprego do cliente
8. **dob:** data de nascimento do cliente

In [9]:
customers = pd.read_csv("data/customers.csv")
customers.info()
customers.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1100 entries, 0 to 1099
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cc_num  1100 non-null   int64
 1   first   1100 non-null   object
 2   last    1100 non-null   object
 3   gender  1100 non-null   object
 4   street  1100 non-null   object
 5   city    1100 non-null   object
 6   zip     1080 non-null   float64
 7   job     1080 non-null   object
 8   dob     1100 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 77.5+ KB

,cc_num,first,last,gender,street,city,zip,job,dob
0,2468117351683689,Jane,Clark,M,1st Ave,Los Angeles,14540.0,Lawyer,1992-12-07
1,7312796986089604,Alice,Johnson,F,Elm St,Houston,24562.0,Clerk,1969-09-29
2,8219705739824918,Bob,Clark,M,1st Ave,Phoenix,60521.0,Doctor,2002-12-20
3,9983622937436029,Jane,Johnson,F,2nd Ave,Phoenix,71277.0,Teacher,1970-03-13
4,5847400826403727,Bob,Johnson,M,Maple St,Los Angeles,69097.0,Engineer,1986-08-20

O ficheiro **merchants.csv**, que contém os detalhes de cada comerciante, é constituído por 100 linhas e 5 colunas.

Cada linha representa um comerciante e as colunas são as seguintes:

0. **merchant:** nome do comerciante
1. **category:** categoria do negócio do comerciante
2. **merch_lat:** latitude do comerciante
3. **merch_lon:** longitude do comerciante
4. **merchant_id:** identificador único do comerciante

In [10]:
merchants = pd.read_csv("data/merchants.csv")
merchants.info()
merchants.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   merchant     100 non-null    object
 1   category     98 non-null     object
 2   merch_lat    98 non-null     float64
 3   merch_long   100 non-null    float64
 4   merchant_id  100 non-null    int64
dtypes: float64(2), int64(1), object(2)
memory usage: 4.0+ KB

     merchant   category  merch_lat  merch_long  merchant_id
0  Merchant_1  Groceries -27.531230 -129.203915            1
1  Merchant_2  Groceries -41.654886   90.051574            2
2  Merchant_3  Groceries  40.156147  108.606189            3
3  Merchant_4    Apparel -61.315035  -49.025479            4
4  Merchant_5    Apparel  57.517665 -155.894706            5

O ficheiro **transactions.csv**, que contém os registos de transações individuais, é constituído por 30000 linhas e 9 colunas.

Cada linha representa uma transação e as colunas são as seguintes:

0. **index:** índice da transação
1. **trans_date_trans_time:** data e hora da transação
2. **cc_num:** número do cartão de crédito associado à transação
3. **device_os:** sistema operativo a partir do qual foi efetuada a transação
4. **merchant:** nome do comerciante da transação
5. **amt:** quantidade da transação
6. **trans_num:** número único da transação
7. **unix_time:** *timestamp* *Unix* da transação
8. **is_fraud:** etiqueta que indica se a transação foi fraudulenta (1) ou não (0)

In [11]:
transactions = pd.read_csv("data/transactions.csv")
transactions.info()
transactions.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   index                  30000 non-null  int64
 1   trans_date_trans_time  29900 non-null  object
 2   cc_num                 30000 non-null  int64
 3   device_os              12036 non-null  object
 4   merchant               30000 non-null  object
 5   amt                    29900 non-null  float64
 6   trans_num              30000 non-null  object
 7   unix_time              30000 non-null  int64
 8   is_fraud               30000 non-null  int64
dtypes: float64(1), int64(4), object(4)
memory usage: 2.1+ MB

,index,trans_date_trans_time,cc_num,device_os,merchant,amt,trans_num,unix_time,is_fraud
0,5381,2023-01-01 00:39:03,2801374844713453,NaN,Merchant_85,252.75,TRANS_662964,1672533543,0
1,4008,2023-01-01 01:16:08,3460245159749480,NaN,Merchant_23,340.17,TRANS_134939,1672535768,0
2,1221,2023-01-01 01:24:28,7308701990157768,macOS,Merchant_70,76.38,TRANS_258923,1672536268,0
3,9609,2023-01-01 02:06:57,8454886440761098,X11,Merchant_33,368.88,TRANS_226814,1672538817,0
4,5689,2023-01-01 02:10:54,6350332939133843,NaN,Merchant_90,323.32,TRANS_668449,1672539054,0

### Descrição dos Dados

### Exploração dos Dados

### Verificação da Qualidade dos Dados

## Preparação dos Dados

## Análise Descritiva